#신형 자동차의 에너지 소비효율 등급
#슬통 자동자는 매해 출시되는 신형 자동차의 에너지 소비효율 등급을 1등급으로 유지하고 있다. 22
#년 개발된 신형 모델이 한국 자동차 평가원에서 설정한 에너지 소비 효율등급 1등급을 받을 수 있을지
#검정하려한다. 평가원에 따르면 1등급의 기준은 평균 복합 에너지 소비효율이 16.0 이상인 경우 부여
#한다고 한다.

#표본에 의하여 판단해볼때, 현대자동차의 신형 모델은 에너지 효율 1등급으로 판단할 수 있을지
#판단해보시오. (유의수준 1%로 설정)

#패키지 불러오기
import numpy as np
import pandas as pd

#다음은 신형 자동차 15대의 복합 에너지소비효율 측정한 결과이다.
x= np.array([15.078, 15.752, 15.549, 15.56, 16.098, 13.277, 15.462, 16.116, 15.214, 16.93, 14.118, 14.927, 15.382, 16.709, 16.804])
x


#15대의 복합 에너지 소비효율 표본평균, 표준편차 구하기
mean = x.mean()
std = x.std(ddof = 1)
t = (mean - 16) / (std /np.sqrt(len(x)))
t
#1. 검정을 위한 가설을 명확하게 서술하시오.
#"현대자동차의 신형 모델은 에너지 효율 1등급이다"

#2. 검정통계량 계산하시오.
#

#3. p‑value을 구하세요.

#4. 현대자동차의 신형 모델의 평균 복합 에너지 소비효율에 대하여 95% 신뢰구간을 구해보세요.
